---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ParameterFilterElement
source: html/e8cb5c2b-b8ca-cbbf-819b-6956e0fd0760.htm
---
# ParameterFilterElement Members

Checks that the parameters of the rules used by the given ElementFilter are valid for this filter's categories.